; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	thermograph4 - mode
	image2 - mode
	infrared0 - mode
	spectrograph5 - mode
	image1 - mode
	spectrograph3 - mode
	thermograph6 - mode
	GroundStation5 - direction
	Star0 - direction
	Star6 - direction
	Star1 - direction
	GroundStation3 - direction
	Star2 - direction
	GroundStation4 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 thermograph4)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star0)
	(supports instrument1 spectrograph3)
	(supports instrument1 thermograph4)
	(supports instrument1 image2)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star6)
	(supports instrument2 image2)
	(supports instrument2 thermograph4)
	(supports instrument2 spectrograph5)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument3 spectrograph5)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star6)
	(supports instrument4 spectrograph5)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 thermograph6)
	(calibration_target instrument5 Star1)
	(calibration_target instrument5 Star6)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument6 image1)
	(supports instrument6 spectrograph5)
	(calibration_target instrument6 Star1)
	(supports instrument7 spectrograph5)
	(supports instrument7 image1)
	(supports instrument7 thermograph4)
	(calibration_target instrument7 Star2)
	(calibration_target instrument7 GroundStation3)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
	(supports instrument8 spectrograph3)
	(supports instrument8 thermograph4)
	(supports instrument8 infrared0)
	(calibration_target instrument8 GroundStation4)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon11)
)
(:goal (and
	(pointing satellite1 Star8)
	(have_image Phenomenon7 thermograph4)
	(have_image Phenomenon7 infrared0)
	(have_image Star8 image1)
	(have_image Star8 thermograph6)
	(have_image Phenomenon9 spectrograph5)
	(have_image Phenomenon9 spectrograph3)
	(have_image Planet10 infrared0)
	(have_image Phenomenon11 infrared0)
))

)

; plan
1. (turn_to satellite3 groundstation4 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 groundstation4)
   goals met: 0 of 9
2. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 0 of 9
3. (calibrate satellite3 instrument8 groundstation4)
   added: (calibrated instrument8)
   goals met: 0 of 9
4. (turn_to satellite3 phenomenon11 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 phenomenon11)
   goals met: 0 of 9
5. (turn_to satellite2 star1 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 star1)
   goals met: 0 of 9
6. (turn_to satellite1 star1 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star1)
   goals met: 0 of 9
7. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 9
8. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 0 of 9
9. (calibrate satellite2 instrument6 star1)
   added: (calibrated instrument6)
   goals met: 0 of 9
10. (calibrate satellite1 instrument5 star1)
   added: (calibrated instrument5)
   goals met: 0 of 9
11. (take_image satellite3 phenomenon11 instrument8 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 1 of 9
12. (turn_to satellite1 star8 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star8)
   goals met: 2 of 9
13. (take_image satellite1 star8 instrument5 thermograph6)
   added: (have_image star8 thermograph6)
   goals met: 3 of 9
14. (turn_to satellite2 phenomenon9 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 phenomenon9)
   goals met: 3 of 9
15. (take_image satellite2 phenomenon9 instrument6 spectrograph5)
   added: (have_image phenomenon9 spectrograph5)
   goals met: 4 of 9
16. (turn_to satellite2 star8 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 star8)
   goals met: 4 of 9
17. (take_image satellite2 star8 instrument6 image1)
   added: (have_image star8 image1)
   goals met: 5 of 9
18. (turn_to satellite3 phenomenon7 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 phenomenon7)
   goals met: 5 of 9
19. (take_image satellite3 phenomenon7 instrument8 infrared0)
   added: (have_image phenomenon7 infrared0)
   goals met: 6 of 9
20. (take_image satellite3 phenomenon7 instrument8 thermograph4)
   added: (have_image phenomenon7 thermograph4)
   goals met: 7 of 9
21. (turn_to satellite3 phenomenon9 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 phenomenon9)
   goals met: 7 of 9
22. (take_image satellite3 phenomenon9 instrument8 spectrograph3)
   added: (have_image phenomenon9 spectrograph3)
   goals met: 8 of 9
23. (turn_to satellite3 planet10 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 planet10)
   goals met: 8 of 9
24. (take_image satellite3 planet10 instrument8 infrared0)
   added: (have_image planet10 infrared0)
   goals met: 9 of 9
